In [1]:
x <- data.frame(k1 = c(1,NA,3,4,5), k2 = c(1,NA,NA,4,5), k3 = 8:12)
y <- data.frame(k1 = c(NA,2,NA,4,5), k2 = c(NA,NA,3,4,5), k3 = 14:18)
x

  k1 k2 k3
1  1  1  8
2 NA NA  9
3  3 NA 10
4  4  4 11
5  5  5 12

In [2]:
y

  k1 k2 k3
1 NA NA 14
2  2 NA 15
3 NA  3 16
4  4  4 17
5  5  5 18

In [3]:
merge(x,y,all=FALSE) ### Inner join

     k1 k2 k3

In [4]:
merge(x,y,all.x=TRUE) ### Left join

  k1 k2 k3
1  1  1  8
2  3 NA 10
3  4  4 11
4  5  5 12
5 NA NA  9

In [5]:
merge(x,y,all.y=TRUE) ### Right join

  k1 k2 k3
1  2 NA 15
2  4  4 17
3  5  5 18
4 NA  3 16
5 NA NA 14

In [6]:
merge(x,y,all=TRUE) ### Outer join

   k1 k2 k3
1   1  1  8
2   2 NA 15
3   3 NA 10
4   4  4 11
5   4  4 17
6   5  5 12
7   5  5 18
8  NA  3 16
9  NA NA  9
10 NA NA 14